[
  {
    "id": "news-1",
    "title": "ConnectHub V2.0 Launched: Enhanced Collaboration Features Now Live!",
    "category": "Product Update",
    "date": "2025-07-25",
    "author": "Marketing Team",
    "imageUrl": "assets/images/news/new-connecthub-v2.jpg",
    "contentPreview": "We're thrilled to announce the official launch of ConnectHub V2.0! This major update brings a suite of enhanced collaboration features designed to streamline your workflows and foster better teamwork...",
    "fullContent": "<p>We're thrilled to announce the official launch of ConnectHub V2.0! This major update brings a suite of enhanced collaboration features designed to streamline your workflows and foster better teamwork. Key new features include:</p><ul><li><b>Real-time Document Co-editing:</b> Collaborate on documents directly within ConnectHub, seeing changes as they happen.</li><li><li><b>Advanced Project Management Tools:</b> Track tasks, milestones, and team progress with intuitive new dashboards.</li><li><b>Improved Communication Channels:</b> New group chat functionalities and integrated video conferencing options.</li></ul><p>Explore the new features today and share your feedback!</p>",
    "tags": ["connecthub", "update", "collaboration", "features"]
  },
  {
    "id": "news-2",
    "title": "Cybersecurity Awareness Month: Phishing Scams Prevention Tips",
    "category": "Security Alert",
    "date": "2025-07-20",
    "author": "IT Security",
    "imageUrl": "assets/images/news/cybersecurity-tips.jpg",
    "contentPreview": "As part of Cybersecurity Awareness Month, our IT Security team is sharing crucial tips to help you identify and prevent phishing scams. Your vigilance is our best defense...",
    "fullContent": "<p>As part of Cybersecurity Awareness Month, our IT Security team is sharing crucial tips to help you identify and prevent phishing scams. Your vigilance is our best defense. Here are key indicators of a phishing attempt:</p><ul><li><b>Suspicious Sender:</b> Email address looks slightly off or generic.</li><li><b>Urgent/Threatening Language:</b> Demands immediate action or threatens consequences.</li><li><b>Generic Salutations:</b> \"Dear Valued Customer\" instead of your name.</li><li><b>Poor Grammar/Spelling:</b> Common in scam emails.</li><li><b>Unexpected Attachments/Links:</b> Be wary of unsolicited files or links.</li></ul><p>Always verify the sender before clicking links or downloading attachments. When in doubt, contact the IT Helpdesk.</p>",
    "tags": ["cybersecurity", "phishing", "security", "awareness"]
  },
  {
    "id": "news-3",
    "title": "Employee Wellness Program: New Yoga Classes Starting Next Week!",
    "category": "Wellness",
    "date": "2025-07-18",
    "author": "HR Department",
    "imageUrl": "assets/images/news/employee-wellness-yoga.jpg",
    "contentPreview": "Prioritizing employee well-being, the HR Department is excited to announce new virtual yoga classes as part of our ongoing wellness program. All employees are invited to join...",
    "fullContent": "<p>Prioritizing employee well-being, the HR Department is excited to announce new virtual yoga classes as part of our ongoing wellness program. All employees are invited to join. Benefits of regular yoga practice include:</p><ul><li>Reduced stress and anxiety</li><li>Improved flexibility and strength</li><li>Enhanced focus and concentration</li></ul><p>Classes will be held every Tuesday and Thursday at 12:30 PM PST, starting next week. Register on the Wellness Portal to secure your spot!</p>",
    "tags": ["wellness", "yoga", "hr", "health"]
  },
  {
    "id": "news-4",
    "title": "Company-Wide Town Hall: Q3 Performance Review & Future Outlook",
    "category": "Company News",
    "date": "2025-07-15",
    "author": "Leadership Team",
    "imageUrl": "assets/images/news/town-hall-meeting.jpg",
    "contentPreview": "Join us for our quarterly Town Hall meeting next Tuesday to review Q3 performance, discuss strategic initiatives, and get an update on our future outlook...",
    "fullContent": "<p>Join us for our quarterly Town Hall meeting next Tuesday to review Q3 performance, discuss strategic initiatives, and get an update on our future outlook. This is an excellent opportunity to hear directly from the leadership team and ask your questions. Key discussion points will include:</p><ul><li>Q3 Financial Highlights</li><li>Project Milestones & Challenges</li><li>Strategic Goals for Q4 and Beyond</li><li>Open Q&A Session</li></ul><p>The meeting will be held virtually via Microsoft Teams. A link will be sent to your calendar invitation shortly.</p>",
    "tags": ["town hall", "company news", "performance", "outlook"]
  },
  {
    "id": "news-5",
    "title": "Celebrating Our Success: ConnectHub Reaches 10,000 Active Users!",
    "category": "Company Milestones",
    "date": "2025-07-10",
    "author": "Communications Dept.",
    "imageUrl": "assets/images/news/milestone-celebration.jpg",
    "contentPreview": "A huge thank you to everyone who contributed to ConnectHub reaching an incredible milestone: 10,000 active users! This achievement reflects our collective dedication...",
    "fullContent": "<p>A huge thank you to everyone who contributed to ConnectHub reaching an incredible milestone: 10,000 active users! This achievement reflects our collective dedication, hard work, and commitment to innovation. We couldn't have done it without you.</p><p>This milestone fuels our determination to continue improving ConnectHub and delivering exceptional value to all users. Let's celebrate this success and look forward to even greater achievements together!</p>",
    "tags": ["milestone", "success", "users", "teamwork"]
  },
  {
    "id": "news-6",
    "title": "Upcoming Software Maintenance: Schedule for July 27th",
    "category": "IT Announcement",
    "date": "2025-07-01",
    "author": "IT Department",
    "imageUrl": "assets/images/news/server-maintenance.jpg",
    "contentPreview": "Please be advised of scheduled software maintenance on Sunday, July 27th, from 2:00 AM to 6:00 AM PST. During this period, ConnectHub services may experience intermittent disruptions...",
    "fullContent": "<p>Please be advised of scheduled software maintenance on Sunday, July 27th, 2025, from 2:00 AM to 6:00 AM PST. During this period, ConnectHub services may experience intermittent disruptions as we perform essential updates and optimizations.</p><p>We apologize for any inconvenience this may cause and appreciate your understanding as we work to improve system performance and security. Please plan your work accordingly. If you experience prolonged issues after the maintenance window, contact the IT Helpdesk.</p>",
    "tags": ["maintenance", "it", "disruption", "schedule"]
  }
]
